BlogSystem/app/controllers/categories_controller.rb

  def index

    @categories = Category.paginate(page: params[:page], per_page: 5)
---
SELECT "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

  def create
    @category = Category.new(category_params)
    @trigger_alert_category_create_invalid = false
    @trigger_alert_category_create_valid = false
    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "My Widget"], ["created_at", "2022-08-23 05:43:03.073245"], ["updated_at", "2022-08-23 05:43:03.073245"]]