BlogSystem/app/controllers/sessions_controller.rb

  def create
    @trigger_alert_login_invalid = false
    @trigger_alert_login_valid = false
    @user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "johndoe@example.com"], ["LIMIT", 1]]